/******************** (C) COPYRIGHT 2016 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：exti.cpp
 * 描	述	：中断
 *                    
 * 实验平台	：FCUV2
 * 硬件连接	：
 * 版 	本	：
 * 从属关系	：
 * 库版本	：V1.0.0
 * 创建时间	：2016.10.03
 * 最后编辑	：2016.10.04
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/
#ifndef __EXTI_H_
#define __EXTI_H_	
/****************************包含头文件*******************************************/
#include "sys.h"
#include "sys_code_ctl.h"

#ifdef __cplusplus
 extern "C" {
#endif
/****************************变量声明*********************************************/
//extern void (*EXTI1_UserHandle_Ptr)(void);
/****************************变量定义*********************************************/

/****************************类对象定义*********************************************/
extern u8 sensta;
/****************************函数声明*********************************************/
void EXTI1_IRQHandler(void);		//此中断服务函数，被汇编调用，需要c编译产生的函数形式！！！
void EXTIX_Init(void);				//外部中断初始化

#ifdef __cplusplus
 }
#endif	 
	 
#endif
/******************* (C) COPYRIGHT 2016 DammStanger *****END OF FILE************/










