/******************** (C) COPYRIGHT 2016 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：FSMC.h
 * 描	述	：实现与TI PLC端的接口协议
 *                    
 * 实验平台	：STM32最小系统
 * 硬件连接	：
 * 版 	本	：
 * 从属关系	：
 * 库版本	：ST3.0.0
 * 创建时间	：2016.1.1
 * 最后编辑	：2016.1.1
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/

#ifndef __FSMC_H_
#define __FSMC_H_

/****************************包含头文件*******************************************/
#include "stm32f4xx.h"
/****************************宏定义***********************************************/
/*
/需要注意的是：内部CPU以字节（8位）为单位编址，int型数组以字（32位）单位，
而FSMC对外是16位的数据线，所以其以半字（16位）编址，各不相同，要求内存对齐：

如：定义外部存储数组int dat[2]; 起始地址0x60000000 ,则dat对内部CPU来说占了4个字节：0x60000000-0x60000007,
则再定义别的变量int dat2; 分配的地址就应该从0x60000004开始。

；而对于外存，由于数据为16位，地址是按16位编址，与内部无关，int dat[2]; 占用外部地址：0x00-0x03	

int型数组以字（32位）为单位,即数组索引的加1减1对应内部地址+4 -4,外部16位存储器+2，-2。

*/
#define Bank1_SRAM1_ADDR    ((vu32)(0x60000000)) //
#define RAM_32B_ADDR_OFFSET	0U			
#define RAM_32B_SIZE		50U					//占用内部地址资源：0x60000000-0x600000c8  200字节	外部地址0x0000-0x0063 100字
#define RAM_16B_ADDR_OFFSET	300U	
#define RAM_16B_SIZE		10U					//占用内部地址资源：0x600001c2-0x6000013f  20字节	外部地址0x0096-0x009f 10字
/****************************类型定义*********************************************/

/****************************类定义*********************************************/
class FSMC
{
public:
	FSMC(vu32 ram_32[],vu16 ram_16[])
	{
		ram_32b = ram_32;
		ram_16b = ram_16;
	}
	
	void Init();
	void WriteBuf16(u8 WriteAddr,u16* pBuffer,u8 n);
	void WriteBuf32(u8 WriteAddr,u32* pBuffer,u8 n);
	void ReadBuf16(u8 ReadAddr,u16* pBuffer,u8 n);
	void ReadBuf32(u8 ReadAddr,u32* pBuffer,u8 n);
	void Write16b(u8 WriteAddr,u16 dat);
	void Write32b(u8 WriteAddr,u32 dat);
	u16 Read16b(u8 WriteAddr);
	u32 Read32b(u8 WriteAddr);
private:
	vu32 * ram_32b;	
	vu16 * ram_16b;	
};

/****************************变量声明*********************************************/
extern FSMC fsmc;
/****************************变量定义*********************************************/


#endif
/******************* (C) COPYRIGHT 2016 DammStanger *****END OF FILE************/

