/******************** (C) COPYRIGHT 2016 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：AHRS.cpp
 * 描	述	：航姿参考系统类
 *                    
 * 实验平台	：
 * 硬件连接	：
 * 版 	本	：
 * 从属关系	：
 * 库版本	：
 * 创建时间	：2016.9.28
 * 最后编辑	：2016.9.28
  **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/

/****************************包含头文件*******************************************/
#include "AHRS.h"
/****************************宏定义***********************************************/

/****************************变量声明*********************************************/

/****************************变量定义*********************************************/

/****************************类对象定义*********************************************/


/****************************函数声明*********************************************/
using math::Qunion;


#define Kp 2.0f        //加速度权重，越大则向加速度测量值收敛越快
#define Ki 0.001f      //误差积分增益
void AHRS::Quaterion_CF(Vector3 gyro,Vector3 acc,float T)
{
	Vector3  V_gravity, V_error, V_error_I;
	
	//重力加速度归一化
	acc.normalize();	
	
	//提取四元数的等效余弦矩阵中的重力分量
	V_gravity = Qunion.col_vector(3);
	
	//向量叉积得出姿态误差
	V_error = acc % V_gravity;
	
	//对误差进行积分	
	V_error_I += V_error * Ki;
	
	//互补滤波，姿态误差
	V_error_I += V_error * Kp;		
	
	//将得到的姿态误差，补偿到角速度上，修正角速度积分漂移
	ahrs_dat.angvel += V_error_I;		
	
	//一阶龙格库塔法更新四元数
	Qunion.update_Runge_Kutta_1st(ahrs_dat.angvel,T);
	
	//四元数归一化
	Qunion.normalize();

	//四元数转欧拉角
	ahrs_dat.att_euler = Qunion.to_euler();

}
 

/******************* (C) COPYRIGHT 2016 DammStanger *****END OF FILE************/

